export const degreesToDirection = (degrees: number) => {
  const directions = [
    'Паўночны',
    'Паўночна-паўночна-ўсходні',
    'Паўночна-ўсходні',
    'Усходні, паўночна-ўсходні',
    'Усходні',
    'Усходні, паўднёва-ўсходні',
    'Паўднёва-ўсходні',
    'Паўднёва-паўднёва-ўсходні ',
    'Паўднёвы',
    'Паўднёва-паўднёва-заходні',
    'Паўднёва-заходні',
    'Заходні, паўднёва-заходні',
    'Заходні',
    'Заходні, паўночна-заходні',
    'Паўночна-заходні',
    'Паўночна-паўночна- заходні',
  ];
  const index =
    Math.round(((degrees %= 360) < 0 ? degrees + 360 : degrees) / 22.5) % 16;
  return directions[index];
};
