export enum Buttons {
  Weather = 'Weather',
  Cources = 'Cources',
  Kick = 'Kick',
}

export const kickAnswers = [
  'Ой, не штурхай мяне! Я адчувальны бот 😄',
  'Ай, ай, ай! Мне не падабаецца, калі мяне штурхаюць.',
  'Ты ўпэўнены, што гэта было трэба? Я крыху разгубіўся 😅',
  'Ага, дык вось як ты забаўляешся? Але я ўсё роўна табе адкажу!',
  'Ух ты, хтосьці вырашыў пажартаваць са мной! Жарт атрымаўся!',
  'Штурхнуў мяне, а што зараз будзеш рабіць?',
  'Ты мяне штурхнуў, але я ўсё роўна тут і гатовы размаўляць. Што ты хочаш?',
  'Штурхнуў мяне? Добра, я дарую, але не забывай, што я таксама ўмею адказваць!',
  'Папярэджваю, не трэба ператвараць мяне ў бота-шарык 😄 Што ты хочаш даведацца?',
];
